# SweptProfile Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptProfile Class
Members See Also
---
Represents an extruded profile swept along a driving curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class SweptProfile : IDisposable
```

Visual Basic
---
```text
Public Class SweptProfile _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SweptProfile : IDisposable
```

# Remarks
Elements such as beams may be formed from a profile that has been swept along a curve. This class represents such a form and is used to access the cross section and the underlying curve that make up the Element.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SweptProfile
# See Also
SweptProfile Members
Autodesk.Revit.DB Namespace